In [3]:
! pip install selenium

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: selenium in c:\users\admin\appdata\roaming\python\python39\site-packages (4.8.3)
Requirement already satisfied: certifi>=2021.10.8 in c:\programdata\anaconda3\lib\site-packages (from selenium) (2021.10.8)
Requirement already satisfied: trio~=0.17 in c:\users\admin\appdata\roaming\python\python39\site-packages (from selenium) (0.22.0)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\admin\appdata\roaming\python\python39\site-packages (from selenium) (0.10.2)
Requirement already satisfied: urllib3[socks]~=1.26 in c:\programdata\anaconda3\lib\site-packages (from selenium) (1.26.9)
Requirement already satisfied: outcome in c:\users\admin\appdata\roaming\python\python39\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: async-generator>=1.9 in c:\users\admin\appdata\roaming\python\python39\site-packages (from trio~=0.17->selenium) (1.10)
Requirement already satisfied: idna in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (3.3)
Requirement already satisfied: exceptiongroup>=1.0.0rc9 in c:\users\admin\appdata\roaming\python\python39\site-packages (from trio~=0.17->selenium) (1.1.1)
Requirement already satisfied: sortedcontainers in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: cffi>=1.14 in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.15.0)
Requirement already satisfied: attrs>=19.2.0 in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (21.4.0)
Requirement already satisfied: sniffio in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: pycparser in c:\programdata\anaconda3\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.21)
Requirement already satisfied: wsproto>=0.14 in c:\users\admin\appdata\roaming\python\python39\site-packages (from trio-websocket~=0.9->selenium) (1.2.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\programdata\anaconda3\lib\site-packages (from urllib3[socks]~=1.26->selenium) (1.7.1)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\admin\appdata\roaming\python\python39\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.14.0)

# Q1: Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data.

In [1]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings("ignore")
 
from selenium.webdriver.common.by import By 
import time

In [69]:
driver=webdriver.Chrome(r'chromedriver')
driver

In [70]:
driver.get('https://www.naukri.com/')

In [71]:
designation=driver.find_element(By.CLASS_NAME,"suggestor-input ")
designation.send_keys('Data Analyst')

In [72]:
location= driver.find_element(By.XPATH,"/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input")
location.send_keys('Bangalore')

In [73]:
search= driver.find_element(By.CLASS_NAME,'qsbSubmit')
search.click()

In [75]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [76]:
title_tags= driver.find_elements (By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)
    
location_tags=driver.find_elements(By.XPATH,'//span[@title="Bangalore/Bengaluru "]')
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)
    
company_tags=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)
    
experience_tags=driver.find_elements (By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in experience_tags[0:10]:
    experience=i.text
    experience_required.append(experience)

In [77]:
print(len(job_title),len(job_location),len(company_name),len(experience_required))

10 10 10 10

In [78]:
print('\nfirst 10 data analyst jobs in Banglore \n ')
df=pd.DataFrame({'Job Profile':job_title,'Location':job_location,'Company':company_name,'Experienced Required':experience_required })
df

first 10 data analyst jobs in Banglore

,Job Profile,Location,Company,Experienced Required
0,Data Engineer/Data Analyst,Bangalore/Bengaluru,Tech Mahindra,6-11 Yrs
1,Data Analyst,Bangalore/Bengaluru,Ingersoll Rand,3-6 Yrs
2,Data Analyst,Bangalore/Bengaluru,Unusual Hire,1-4 Yrs
3,Data Analyst - Contractual,Bangalore/Bengaluru,Search Advisers Services Guj,2-3 Yrs
4,Data Analyst - Contractual,Bangalore/Bengaluru,Search Advisers Services Guj,2-3 Yrs
5,"Data Analyst, Grp 4.3",Bangalore/Bengaluru,ANZ,5-9 Yrs
6,ExcelHER-Data Analyst,Bangalore/Bengaluru,Volvo Financial Services,3-5 Yrs
7,Data Analyst,Bangalore/Bengaluru,Clarivate,2-4 Yrs
8,Data Analyst,Bangalore/Bengaluru,Novel Office,0-2 Yrs
9,Data Analyst - EdTech,Bangalore/Bengaluru,Talentstack,2-6 Yrs

In [ ]:
driver.quit()

# Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data

In [3]:
driver=webdriver.Chrome(r'chromedriver')
driver

In [4]:
driver.get('https://www.naukri.com/')

In [5]:
designation=driver.find_element(By.CLASS_NAME,"suggestor-input ")
designation.send_keys('Data Scientist')

In [6]:
location= driver.find_element(By.XPATH,"/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input")
location.send_keys('Bangalore')

In [7]:
search= driver.find_element(By.CLASS_NAME,'qsbSubmit')
search.click()

In [8]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [9]:
title_tags= driver.find_elements (By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)
    
location_tags=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)
    
company_tags=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)
    
experience_tags=driver.find_elements (By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in experience_tags[0:10]:
    experience=i.text
    experience_required.append(experience)

In [10]:
print(len(job_title),len(job_location),len(company_name),len(experience_required))

10 10 10 10

In [14]:
print('\n first 10 Data Science job in banglore\n')
df=pd.DataFrame({'Job Profile':job_title,'Location':job_location,'Company':company_name,'Experienced Required':experience_required })
df

 first 10 Data Science job in banglore

,Job Profile,Location,Company,Experienced Required
0,Data Science Professional - IBM SPSS Statistic...,"Bangalore/Bengaluru, Noida, Mumbai, Pune, Chennai",Hexaware Technologies,5-8 Yrs
1,Data Science Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture,2-4 Yrs
2,Analystics & Modeling Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture,6-8 Yrs
3,Senior data scientist,"Bangalore/Bengaluru, Mumbai, Pune, Chennai, Gu...",Fractal Analytics,4-8 Yrs
4,Data Scientist_NLP,"Bangalore/Bengaluru, Mumbai, Pune, Chennai, Gu...",Fractal Analytics,5-11 Yrs
5,Data Scientist,"Bangalore/Bengaluru, Mumbai, Pune, Chennai, Gu...",Fractal Analytics,3-7 Yrs
6,Machine Learning (AI) Architect,"Bangalore/Bengaluru, Kolkata, Mumbai, New Delh...",Persistent,5-12 Yrs
7,Manager - Innovations Hub - Machine Learning,"Bangalore/Bengaluru, Mumbai, Hyderabad/Secunde...",PwC,7-9 Yrs
8,Senior Engineer Consultant Data Science,Bangalore/Bengaluru,Verizon,4-9 Yrs
9,Senior Engineer Consultant-Data Science,Bangalore/Bengaluru,Verizon,4-9 Yrs

# You have to scrape data for “Data Scientist” designation for first 10 job results. You have to scrape the job-title, job-location, company name, experience required. The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs

In [2]:
driver=webdriver.Chrome(r'chromedriver')
driver

In [27]:
driver.get('https://www.naukri.com/')

In [28]:
designation= driver.find_element(By.CLASS_NAME,'suggestor-input ')
designation.send_keys ('Data Scientist')

In [29]:
search=driver.find_element(By.CLASS_NAME,'qsbSubmit')
search.click()

In [30]:
location_filter =driver.find_element(By.XPATH,'//span[@title="Delhi / NCR"]')
location_filter.click()

In [31]:
salary_filter= driver.find_element(By.XPATH,'//span[@title="3-6 Lakhs"]')
salary_filter.click()

In [36]:
job_title=[]
location=[]
company_name=[]
experience_required=[]
salary_base=[]

In [37]:
title_tags=driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)
    
location_tags=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in location_tags[0:10]:
    loc=i.text
    location.append(loc)
    
company_tags=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)
    
experience_tags=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in experience_tags[0:10]:
    experience=i.text
    experience_required.append(experience)
    
salary_tags=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft "]')
for i in salary_tags[0:10]:
    salary=i.text
    salary_base.append(salary)

In [38]:
df=pd.DataFrame({'Job Title':job_title,'Location':location,'Company Name':company_name,'Experience Required':experience_required,'Salary':salary_base})
df

,Job Title,Location,Company Name,Experience Required,Salary
0,Data Scientist,"Temp. WFH - Kochi/Cochin, Kolkata, Hyderabad/S...",Cognizant,6-10 Yrs,Not disclosed
1,Junior Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Analytos,0-2 Yrs,Not disclosed
2,Data Scientist,"Gurgaon/Gurugram, Bangalore/Bengaluru",Blackbuck,3-7 Yrs,Not disclosed
3,Junior Data Scientist,"Gurgaon/Gurugram, United States (USA), Bulgaria",Adidas,1-6 Yrs,Not disclosed
4,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Tabsquare,1-3 Yrs,Not disclosed
5,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Analytos,2-4 Yrs,Not disclosed
6,Analyst-Data Science,Gurgaon/Gurugram,AMERICAN EXPRESS,0-3 Yrs,Not disclosed
7,Analyst-Data Science,Gurgaon/Gurugram,AMERICAN EXPRESS,0-3 Yrs,Not disclosed
8,Senior Data Scientist,"Hyderabad/Secunderabad, Chenani, Gurgaon/Gurug...",RecruitEForU,3-8 Yrs,Not disclosed
9,Assistant Manager/Senior Manager - Data Scientist,"Gurgaon/Gurugram, Bangalore/Bengaluru",Huquo Consulting Pvt. Ltd,2-7 Yrs,Not disclosed

# Q4: Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
1. Brand
2. ProductDescription
3. Price

In [39]:
driver=webdriver.Chrome(r'chromedriver')
driver

In [40]:
driver.get('https://www.flipkart.com/')

In [41]:
product_search= driver.find_element(By.CLASS_NAME,'_3704LK')
product_search.send_keys('sunglasses')

In [42]:
product_search= driver.find_element(By.CLASS_NAME,'L0Z3Pu')
product_search.click()

In [66]:
brand=[]
   
price=[]

In [67]:


for page in range(0,3):
    brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in brand_tags[0:100]:
        brand.append(i.text)       
            
    price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in price_tags[0:100]:
        price.append(i.text)
            
    desc_tags=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for i in desc_tags[0:130]:
         product_desc.append(i.text)        
    
        
        
    next_button= driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
        
    time.sleep(5)

In [71]:
print(len(brand),len(product_desc),len(price))

120 120 120

In [75]:
print('\n TOP 100 SUNGLASSES LIST AND DETAILS\n')

df=pd.DataFrame({'Brand':brand,'Product_description':product_desc,'Price':price})
df.head(100)

 TOP 100 SUNGLASSES LIST AND DETAILS

,Brand,Product_description,Price
0,PIRASO,"Polarized, UV Protection Aviator Sunglasses (55)",₹182
1,Fastrack,UV Protection Sports Sunglasses (62),₹999
2,SUNBEE,UV Protection Wayfarer Sunglasses (50),₹185
3,Hooper,"UV Protection Cat-eye, Retro Square, Oval, Rou...",₹597
4,Elligator,UV Protection Aviator Sunglasses (Free Size),₹129
...,...,...,...
95,john jacobs,"UV Protection, Polarized, Mirrored Rectangular...","₹2,000"
96,kingsunglasses,UV Protection Sports Sunglasses (65),₹190
97,ROYAL SON,"Polarized, UV Protection Retro Square Sunglass...",₹599
98,PIRASO,UV Protection Round Sunglasses (53),₹232
99,Velocity Eyewear,UV Protection Wayfarer Sunglasses (56),"₹1,499"

# Q5: Scrape 100 reviews data from flipkart.com for iphone11 phone

In [46]:
driver=webdriver.Chrome(r'chromedriver')
driver

In [47]:
driver.get('https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&market')

In [4]:
rating=[]
review=[]
full_review=[]

In [5]:
for page in range(0,10):
    rating_tags=driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
    for i in rating_tags:
        rating.append(i.text)
        
    review_tags= driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
    for i in review_tags:
        review.append(i.text)
        
        
    full_review_tags= driver.find_elements   (By.XPATH,"//div[@class='t-ZTKy']/div/div")    
    for i in full_review_tags:

        full_review.append(i.text)
        
    next_button= driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [6]:
print(len(rating),len(review),len(full_review))

100 100 100

In [7]:
df= pd.DataFrame({'RATING': rating,'REVIEW':review,'FULL REVIEW':full_review})
df

,RATING,REVIEW,FULL REVIEW
0,5,Simply awesome,Really satisfied with the Product I received.....
1,5,Perfect product!,Amazing phone with great cameras and better ba...
2,5,Best in the market!,Great iPhone very snappy experience as apple k...
3,4,Value-for-money,I'm Really happy with the product\nDelivery wa...
4,5,Highly recommended,It's my first time to use iOS phone and I am l...
...,...,...,...
95,5,Worth every penny,Previously I was using one plus 3t it was a gr...
96,4,Pretty good,I was using Iphone 6s and also Oneplus 6t. Bot...
97,5,Perfect product!,Value for money\n5 star rating\nExcellent came...
98,5,Highly recommended,What a camera .....just awesome ..you can feel...
99,5,Great product,Amazing Powerful and Durable Gadget.\n\nI’m am...

#  Q6: Scrape data for first 100 sneakers you find when you visit flipkart.com and search for “sneakers” in the search field.

In [38]:
driver=webdriver.Chrome(r'chromedriver')
driver

In [39]:
driver.get('https://www.flipkart.com/')

In [40]:
search_product= driver.find_element(By.CLASS_NAME,'_3704LK')
search_product.send_keys('sneakers')

In [41]:
search =driver.find_element(By.CLASS_NAME,'L0Z3Pu')
search.click()

In [42]:
brand=[]
product_description=[]
price=[]

In [43]:
for page in range (0,3):
    brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in brand_tags[0:100]:
        
        brand.append(i.text)
        
        
    description_tags=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for i in description_tags[0:100]:
        product_description.append(i.text)
            
    
     
    price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in price_tags[0:100]:
        
    
        price.append(i.text)
        
        
        
    next_button= driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [44]:
print(len(brand),len(product_description),len(price))

120 120 120

In [45]:
df=pd.DataFrame({'BRAND':brand,'PRODUCT DESCRIPTION': product_description,'PRICE': price})
df.head(100)

          BRAND                                PRODUCT DESCRIPTION   PRICE
0      RapidBox                                   Sneakers For Men    ₹571
1   New Balance                               500 Sneakers For Men  ₹4,215
2           SFR  2006 Trenddy Fashion Sporty Casuals Sneakers R...    ₹299
3          aadi  Synthetic| Lightweight| Premiun| Comfort| Summ...    ₹399
4         AMICO                                   Sneakers For Men    ₹387
..          ...                                                ...     ...
95        BIRDE  Premium Sports Shoes For Men Pack Of 2 Sneaker...    ₹499
96       Footox  Sneaker for Mens | Casual Shoes | Men Shoes Sn...    ₹399
97  New Balance                               237 Sneakers For Men  ₹5,424
98         aadi                                   Sneakers For Men    ₹349
99        AMICO                                   Sneakers For Men    ₹452

[100 rows x 3 columns]

# Q7: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then set CPU Type filter to “Intel Core i7”

In [2]:
driver=webdriver.Chrome(r'chromedriver')
driver

In [3]:
driver.get('https://www.amazon.in/')

In [4]:
search_product= driver.find_element(By.XPATH,'//input[@class="nav-input nav-progressive-attribute"]')
search_product.send_keys('Laptop')

In [28]:
search= driver.find_element(By.XPATH,"//div[@class='nav-search-field ']//input")
search.click()

In [39]:
specification_filter=driver.find_element(By.XPATH,'//li[@aria-label="Intel Core i7"]')
specification_filter.click()

In [5]:
title=[]
rating=[]
price=[]

In [6]:
title_tags=driver.find_elements(By.XPATH,'//span[@class="a-size-medium a-color-base a-text-normal"]')
for i in title_tags[0:10]:
    title.append(i.text)
    
rating_tags=driver.find_elements(By.XPATH,'//span[@class="a-size-base"]')
for i in rating_tags[0:10]:
    rating.append(i.text)

price_tags=driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in price_tags[0:10]:
    price.append(i.text)

In [7]:
print(len(title),len(rating),len(price))

10 10 10

In [9]:
df=pd.DataFrame({'Title':title,'Rating':rating,'Price':price})
df

                                               Title Rating     Price
0  Samsung Galaxy Book2 (NP750) Intel 12th Gen co...    4.1    79,990
1  ASUS TUF Gaming F15 (2022), 15.6"(39.62 cms) F...    4.4  1,00,990
2  (Renewed) HP ELITEBOOK 840 G5 (Core i7 8th GEN...    4.0    31,490
3  ASUS Vivobook S15 OLED 2022, 15.6" 39.62 cms F...    4.1    84,990
4  LG Gram16 Intel EVO-[12th Gen Core i7/Win11/16...    4.1    99,990
5  ASUS TUF Gaming F15 (2022), 15.6" (39.62 cms) ...    4.3    94,990
6  Lenovo IdeaPad Slim 5 Intel Core i7 12th Gen 1...    3.0    31,592
7  (Renewed) HP 840g3 Elitebook 14 Inch Screen La...    3.6    98,990
8  Lenovo ThinkPad E14 Intel Core i7 12th Gen 14"...    3.8  1,67,990
9  Dell Alienware x14 Gaming Laptop,Intel i7-1270...    4.1    56,990

# Q8: Write a python program to scrape data for Top 1000 Quotes of All Time.

In [15]:
driver=webdriver.Chrome(r'chromedriver')
driver

In [16]:
driver.get('https://www.azquotes.com/')

In [17]:
top=driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a')
top.click()

In [18]:
quote=[]
author=[]
quote_type=[]

In [19]:
for page in range(0,9):
    quote_tags=driver.find_elements(By.XPATH,'//a[@class="title"]')
    for i in quote_tags:
        quote.append(i.text)
    
    author_tags=driver.find_elements(By.XPATH,'//div[@class="author"]')
    for i in author_tags:
        author.append(i.text)
        
    type_tags= driver.find_elements(By.XPATH,'//div[@class="tags"]')
    for i in type_tags:
        quote_type.append(i.text)
        
        
    next_button=driver.find_element(By.XPATH,'//li[@class="next"]')
    next_button.click()
    time.sleep(3)

In [20]:
print(len(quote),len(author),len(quote_type))

900 900 900

In [21]:
df=pd.DataFrame({'QUOTE':quote,'AUTHOR NAME':author,'TYPE':quote_type})
df

,QUOTE,AUTHOR NAME,TYPE
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
895,To love means loving the unlovable. To forgive...,Gilbert K. Chesterton,"Love, Inspirational, Success"
896,Be brave. Take risks. Nothing can substitute e...,Paulo Coelho,"Encouraging, Courage, Inspiration"
897,"If you really want to do something, you'll fin...",Jim Rohn,"Inspirational, Motivational, Success"
898,It is neither wealth nor splendor; but tranqui...,Thomas Jefferson,"Life, Happiness, Work"
899,A thousand words will not leave so deep an imp...,Henrik Ibsen,"Inspirational, Inspiring, Positivity"

# Q9: Write a python program to display list of respected former Prime Ministers of India(i.e. Name, Born-Dead, Term of office, Remarks) from https://www.jagranjosh.com/.

In [2]:
driver=webdriver.Chrome(r'chromedriver')
driver

In [3]:
driver.get('https://www.jagranjosh.com/')

In [4]:
gk_option = driver.find_element(By.XPATH,'/html/body/div/div[1]/div/div[1]/div/div[5]/div/div[1]/header/div[3]/ul/li[9]')
gk_option.click()

In [5]:
prime_minister= driver.find_element(By.XPATH,'/html/body/div/div/div/div[2]/div/div[10]/div/div/ul/li[2]/a')
prime_minister.click()

In [6]:
name=[]
born=[]
term=[]
remark=[]

In [7]:
name_tags= driver.find_elements(By.XPATH,'//div[@class="table-box"]/table/tbody/tr/td[2]/p')
for i in name_tags:
    name.append(i.text)

term_tags=driver.find_elements(By.XPATH,'//div[@class="table-box"]/table/tbody/tr/td[4]/p')
for i in term_tags:
    term.append(i.text)
    
born_tags=driver.find_elements(By.XPATH,'//div[@class="table-box"]/table/tbody/tr/td[3]/p')
for i in born_tags:
    born.append(i.text)

    
remark_tags=driver.find_elements(By.XPATH,'//div[@class="table-box"]/table/tbody/tr/td[5]/p')
for i in remark_tags:
    remark.append(i.text)

In [14]:
print(len(name),len(born),len(required_data),len(remark))

18 18 18 18

In [16]:
term

['15 August 1947 to 27 May 1964',
 '16 years, 286 days',
 '27 May 1964 to 9 June 1964,',
 '13 days',
 '9 June 1964 to 11 January 1966',
 '1 year, 216 days',
 '11 January 1966 to 24 January 1966',
 '13 days',
 '24 January 1966 to 24 March 1977',
 '11 years, 59 days',
 '24 March 1977 to  28 July 1979 ',
 '2 year, 126 days',
 '28 July 1979 to 14 January 1980',
 '170 days',
 '14 January 1980 to 31 October 1984',
 '4 years, 291 days',
 '31 October 1984 to 2 December 1989',
 '5 years, 32 days',
 '2 December 1989 to 10 November 1990',
 '343 days',
 '10 November 1990 to 21 June 1991',
 '223 days',
 '21 June 1991 to 16 May 1996',
 '4 years, 330 days',
 '16 May 1996 to 1 June 1996',
 '16 days',
 '1 June 1996 to 21 April 1997',
 '324 days',
 '21 April 1997 to 19 March 1998 ',
 '332 days',
 '19 March 1998 to 22 May 2004 ',
 '6 years, 64 days',
 '22 May 2004 to 26 May 2014   ',
 '10 years, 4 days',
 '26 May 2014 - Present']

In [9]:
required_data = []
for i in range(len(term)):
    
    if "to" in term[i]:
        required_data.append(term[i])

In [12]:
data=['26 May 2014 - Present']
data

['26 May 2014 - Present']

In [13]:
required_data.append(data)

In [15]:
df=pd.DataFrame({'NAME':name,'BORN-DEAD':born,'TERM OF OFFICE':required_data,'REMARK':remark})
df

,NAME,BORN-DEAD,TERM OF OFFICE,REMARK
0,Jawahar Lal Nehru,(1889–1964),15 August 1947 to 27 May 1964,The first prime minister of India and the long...
1,Gulzarilal Nanda (Acting),(1898-1998),"27 May 1964 to 9 June 1964,",First acting PM of India
2,Lal Bahadur Shastri,(1904–1966),9 June 1964 to 11 January 1966,He has given the slogan of 'Jai Jawan Jai Kisa...
3,Gulzari Lal Nanda (Acting),(1898-1998),11 January 1966 to 24 January 1966,-
4,Indira Gandhi,(1917–1984),24 January 1966 to 24 March 1977,First female Prime Minister of India
5,Morarji Desai,(1896–1995),24 March 1977 to 28 July 1979,Oldest to become PM (81 years old) and first t...
6,Charan Singh,(1902–1987),28 July 1979 to 14 January 1980,Only PM who did not face the Parliament
7,Indira Gandhi,(1917–1984),14 January 1980 to 31 October 1984,The first lady who served as PM for the second...
8,Rajiv Gandhi,(1944–1991),31 October 1984 to 2 December 1989,Youngest to become PM (40 years old)
9,V. P. Singh,(1931–2008),2 December 1989 to 10 November 1990,First PM to step down after a vote of no confi...
10,Chandra Shekhar,(1927–2007),10 November 1990 to 21 June 1991,He belongs to Samajwadi Janata Party
11,P. V. Narasimha Rao,(1921–2004),21 June 1991 to 16 May 1996,First PM from south India
12,Atal Bihari Vajpayee,(1924- 2018),16 May 1996 to 1 June 1996,PM for shortest tenure
13,H. D. Deve Gowda,(born 1933),1 June 1996 to 21 April 1997,He belongs to Janata Dal
14,Inder Kumar Gujral,(1919–2012),21 April 1997 to 19 March 1998,------
15,Atal Bihari Vajpayee,(1924-2018),19 March 1998 to 22 May 2004,The first non-congress PM who completed a ful...
16,Manmohan Singh,(born 1932),22 May 2004 to 26 May 2014,First Sikh PM
17,Narendra Modi,(born 1950),[26 May 2014 - Present],4th Prime Minister of India who served two con...

#  Q10: Write a python program to display list of 50 Most expensive cars in the world (i.e. Car name and Price) from https://www.motor1.com/

In [2]:
driver=webdriver.Chrome(r'chromedriver')
driver

In [3]:
driver.get('https://www.motor1.com/')

In [4]:
search=driver.find_element(By.CLASS_NAME,'m1-search-panel')
search.click()

In [5]:
search=driver.find_element(By.XPATH,'//input[@class="m1-search-panel-input m1-search-form-text js-bound"]')
search.send_keys(' 50 Most Expensive Cars In The World')

In [7]:
search=driver.find_element(By.XPATH,'//input[@class="m1-search-panel-input m1-search-form-text js-bound"]')
search.click()

In [29]:
top=driver.find_element(By.XPATH,'/html/body/div[8]/div[9]/div/div[1]/div/div/div[5]/div/div[1]/h3/a')
top.click()

In [6]:
car=[]
price=[]

In [7]:
car_tags=driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
for i in car_tags:
    car.append(i.text)

In [8]:
price_tags= driver.find_elements(By.XPATH,'//strong')
for i in price_tags:
    price.append(i.text)

In [9]:
print(len(car),len(price))

51 51

In [10]:
df=pd.DataFrame({'CAR':car,'PRICE':price})
df

                                 CAR                        PRICE
0                      De Tomaso P72          Price: $1.3 Million
1                  Ferrari LaFerrari          Price: $1.4 Million
2                      Pagani Huayra          Price: $1.4 Million
3                       McLaren Elva
4                        Czinger 21C          Price: $1.7 Million
5                      Ferrari Monza          Price: $1.7 Million
6                 Gordon Murray T.33          Price: $1.7 Million
7                  Koenigsegg Gemera          Price: $1.7 Million
8                        Zenvo TSR-S          Price: $1.7 Million
9                 Hennessey Venom F5          Price: $1.7 Million
10                   Bentley Bacalar          Price: $1.8 Million
11     Hispano Suiza Carmen Boulogne          Price: $1.9 Million
12            Bentley Mulliner Batur          Price: $1.9 Million
13                      Deus Vayanne          Price: $2.0 Million
14                       SSC Tuatara          Price: $2.0 Million
15                       Lotus Evija         Price: $2.0 Million*
16               Aston Martin Vulcan          Price: $2.1 Million
17                        Delage D12          Price: $2.3 Million
18                 McLaren Speedtail          Price: $2.3 Million
19                      Rimac Nevera          Price: $2.3 Million
20                     Pagani Utopia          Price: $2.4 Million
21              Pininfarina Battista          Price: $2.5 Million
22                 Ferrari FXX K Evo          Price: $2.5 Million
23                Gordon Murray T.50          Price: $2.6 Million
24              Lamborghini Countach          Price: $2.6 Million
25          Mercedes-AMG Project One          Price: $2.6 Million
26               Aston Martin Victor          Price: $2.7 Million
27       Hennessey Venom F5 Roadster          Price: $3.0 Million
28                  Koenigsegg Jesko                 $3.0 Million
29             Aston Martin Valkyrie          Price: $3.0 Million
30         W Motors Lykan Hypersport          Price: $3.2 Million
31                     McLaren Solus          Price: $3.4 Million
32         Pagani Huayra Roadster BC                 $3.5 Million
33          Bugatti Chiron Pur Sport          Price: $3.5 Million
34                  Lamborghini Sian          Price: $3.6 Million
35                  Koenigsegg CC850          Price: $3.6 million
36   Bugatti Chiron Super Sport 300+          Price: $3.7 Million
37                Lamborghini Veneno          Price: $3.9 Million
38                    Bugatti Bolide          Price: $4.5 Million
39                   Bugatti Mistral          Price: $4.7 Million
40               Pagani Huayra Imola          Price: $5.0 Million
41                      Bugatti Divo          Price: $5.4 Million
42               SP Automotive Chaos          Price: $5.8 Million
43                  Pagani Codalunga          Price: $6.4 Million
44          Mercedes-Maybach Exelero          Price: $7.4 Million
45                Bugatti Centodieci          Price: $8.0 Million
46           Bugatti Chiron Profilée          Price: $9.0 Million
47              Rolls-Royce Sweptail         Price: $10.8 Million
48          Bugatti La Voiture Noire         Price: $12.8 Million
49            Rolls-Royce Boat Tail*         Price: $13.4 Million
50  Most Expensive Cars In The World  Price: $28.0 Million (est.)